const l=0,i="a",e="part0a.md",t="معلومات عامة",n="general_info",s="/images/part-0.svg",p=[{depth:3,id:"المتطلبات-المسبقة",text:"المتطلبات المسبقة"},{depth:3,id:"مادة-الدورة",text:"مادة الدورة"},{depth:3,id:"متابعة-الدورة",text:"متابعة الدورة"},{depth:3,id:"قناة-الدورة-على-discord",text:"قناة الدورة على Discord"},{depth:3,id:"كيف-تحصل-على-المساعدة-في-discord",text:"كيف تحصل على المساعدة في Discord"},{depth:3,id:"الأجزاء-والإكمال",text:"الأجزاء والإكمال"},{depth:3,id:"دراسة-الدورة-باختصار",text:"دراسة الدورة باختصار"},{depth:3,id:"تسليم-التمارين",text:"تسليم التمارين"},{depth:3,id:"اختبار-الدورة",text:"اختبار الدورة"},{depth:3,id:"كيف-تحصل-على-وحداتك",text:"كيف تحصل على وحداتك"},{depth:3,id:"من-أين-أحصل-على-رقم-طالبي-في-جامعة-هلسنكي",text:"من أين أحصل على رقم طالبي في جامعة هلسنكي"},{depth:3,id:"شهادة-الدورة",text:"شهادة الدورة"},{depth:3,id:"طلب-كشف-درجات",text:"طلب كشف درجات"},{depth:3,id:"لا-إصدارات-سنوية-بعد-الآن",text:"لا إصدارات سنوية بعد الآن"},{depth:3,id:"التوسع-في-دورة-أكملتها-سابقا",text:"التوسّع في دورة أكملتها سابقاً"},{depth:3,id:"مشروع-full-stack",text:"مشروع Full stack"},{depth:3,id:"وعد-المقابلة",text:"وعد المقابلة"},{depth:3,id:"قبل-أن-تبدأ",text:"قبل أن تبدأ"},{depth:3,id:"الأخطاء-المطبعية-في-المادة",text:"الأخطاء المطبعية في المادة"}],o=`<div class="content">
<p>هذه الدورة مقدمة إلى تطوير الويب الحديث باستخدام JavaScript. والتركيز الأساسي على التطبيقات أحادية الصفحة المبنية بـ React والداعمة لها عبر خدمات ويب RESTful وGraphQL المبنية بـ Node.js. وتتضمن الدورة أيضاً أجزاءً عن TypeScript وReact Native والتكامل المستمر.</p>
<p>ومن الموضوعات الأخرى تصحيح أخطاء التطبيقات، وتقنية الحاويات، والتهيئة، وإدارة بيئات التشغيل، وقواعد البيانات.</p>
<p>الدورة مجانية بالكامل. يمكنك الحصول على شهادة، بل وحتى على وحدات جامعة هلسنكي وفق نظام ECTS (نظام تحويل وتجميع الوحدات الدراسية الأوروبي) مجاناً.</p>
<h3 id="المتطلبات-المسبقة">المتطلبات المسبقة</h3>
<p>يُتوقَّع من المشاركين امتلاك مهارات برمجية جيدة، ومعرفة أساسية ببرمجة الويب وقواعد البيانات، وإلمام بأساسيات نظام التحكم بالإصدارات Git. ويُتوقَّع منك أيضاً أن تتحلى بالمثابرة والقدرة على حل المشكلات والبحث عن المعلومات بشكل مستقل.</p>
<p>لا يُشترط وجود معرفة مسبقة بـ JavaScript أو بغيرها من موضوعات الدورة.</p>
<p>كم من خبرة البرمجة نحتاج؟ من الصعب تحديد ذلك، لكن ينبغي أن تكون على درجة عالية من الطلاقة في <em>لغتك</em> البرمجية. وتتطلب هذه الدرجة من الطلاقة عادةً ما لا يقل عن 100-200 ساعة من التدريب.</p>
<h3 id="مادة-الدورة">مادة الدورة</h3>
<p>المقصود أن تُقرأ مادة الدورة جزءاً واحداً في كل مرة وبالترتيب.</p>
<p>تحتوي المادة على تمارين موضوعة بحيث توفر المادة السابقة معلومات كافية لحل كل تمرين. يمكنك إنجاز التمارين حالما تصادفها في المادة، لكن قد يكون من المفيد أيضاً قراءة كامل مادة الجزء قبل البدء بالتمارين.</p>
<p>في أجزاء كثيرة من الدورة، تبني التمارين تطبيقاً أكبر واحداً قطعة صغيرة تلو الأخرى. وتُطوَّر بعض تطبيقات التمارين عبر عدة أجزاء.</p>
<p>تستند مادة الدورة إلى تطبيقات مثال تتوسع تدريجياً وتتغير من جزء إلى آخر. من الأفضل متابعة الشيفرة خطوة بخطوة مع إجراء تعديلات صغيرة بنفسك. يمكن العثور على شيفرة تطبيقات المثال لكل خطوة في كل جزء على GitHub.</p>
<h3 id="متابعة-الدورة">متابعة الدورة</h3>
<p>تتضمن الدورة أربعة عشر جزءاً، أولها مرقّم بـ 0 اتساقاً مع النسخ السابقة. ويقابل الجزء الواحد تقريباً أسبوع دراسة (بمعدل 15-20 ساعة)، لكن سرعة إكمال الدورة مرنة.</p>
<p>ليس من المنطقي الانتقال من الجزء <em>n</em> إلى الجزء <em>n+1</em> قبل اكتساب معرفة كافية بموضوعات الجزء <em>n</em>. ومن الناحية التربوية، تعتمد الدورة أسلوب <a href="https://en.wikipedia.org/wiki/Mastery_learning">التعلم التمكني</a>، ولا يُقصد بك الانتقال إلى الجزء التالي إلا بعد إنجاز عدد كافٍ من تمارين الجزء السابق.</p>
<p>في الأجزاء 1-4 يُتوقَّع منك إنجاز <strong>جميع</strong> التمارين التي <strong>لا</strong> تحمل علامة النجمة (*) على الأقل. تُحتسب التمارين المعلّمة بنجمة ضمن تقديرك النهائي، لكن تخطيها لا يمنعك من إنجاز التمارين الإلزامية في الأجزاء التالية. ولا تحتوي الأجزاء 5-13 على تمارين معلّمة بنجمة لعدم وجود اعتماد مشابه على الأجزاء السابقة.</p>
<p>سرعة إكمال الدورة مرنة.</p>
<p>يمكن الاطلاع على إحصاءات زمن إنجاز التمارين عبر <a href="https://studies.cs.helsinki.fi/stats/courses/fullstackopen">نظام التسليم</a>.</p>
<h3 id="قناة-الدورة-على-discord">قناة الدورة على Discord</h3>
<p>يمكنك مناقشة الدورة والموضوعات المتعلقة بها في مجموعتنا المخصصة على Discord <a href="https://study.cs.helsinki.fi/discord/join/fullstack">https://study.cs.helsinki.fi/discord/join/fullstack</a>. ويضم Discord قناتي fullstack_general والقنوات الخاصة بكل جزء (أسماء القنوات التي تبدأ بـ fullstack) للنقاش المتعلق بالدورة. لاحظ أن <em>قناة الدردشة في Discord ليست مناسبة للنقاشات المتعلقة بالدورة</em>. انضم إلى المحادثة!</p>
<h3 id="كيف-تحصل-على-المساعدة-في-discord">كيف تحصل على المساعدة في Discord</h3>
<p>عندما تطلب المساعدة بشأن مشكلة في مجموعة Discord، ينبغي أن يكون سؤالك غنياً بالمعلومات ودقيقاً قدر الإمكان. إذا كان سؤالك هكذا</p>
<blockquote>
<p><em>إضافة شخص جديد لا تعمل، هل يمكنكم مساعدتي في ذلك؟</em></p>
</blockquote>
<p>فمن المرجح جداً ألا يجيب أحد. فقد يكون الخطأ <em>في أي مكان</em>.</p>
<p>قد يكون السؤال الأفضل هكذا</p>
<blockquote>
<ul>
<li>في التمرين 2.15، عندما أحاول إضافة شخص جديد إلى التطبيق، يستجيب الخادم بالرمز 403 رغم أن الطلب يبدو سليماً في نظري.</li>
</ul>
<p>تبدو الشيفرة هكذا</p>
<pre><code class="language-js">  <span class="hljs-comment">// الجزء ذو الصلة من الشيفرة ملصوق هنا</span>
  <span class="hljs-comment">// ينبغي أن تحتوي الشيفرة على عدة عبارات console.log للمساعدة في تصحيح الأخطاء</span>
</code></pre>
<p>وتُطبع العبارات التالية في وحدة التحكم</p>
<pre><code class="language-bash">  // البيانات المطبوعة في وحدة التحكم
</code></pre>
<p>ويبدو تبويب الشبكة هكذا*</p>
<p>[لقطة شاشة من وحدة تحكم الشبكة]</p>
<p>يمكن العثور على كل الشيفرة هنا (رابط إلى GitHub)</p>
</blockquote>
<h3 id="الأجزاء-والإكمال">الأجزاء والإكمال</h3>
<p>تتكون دراسات Full Stack من الدورة الأساسية وعدة امتدادات. ويمكنك إكمال الدراسات بما يعادل 5 إلى 15 وحدة دراسية.</p>
<h4 id="الأجزاء-0-5-الدورة-الأساسية-full-stack-web-development-5-وحدات-دراسية-csm141081">الأجزاء 0-5 (الدورة الأساسية) - Full Stack Web Development (5 وحدات دراسية، CSM141081)</h4>
<p>يعتمد عدد الوحدات وتقدير الدورة على العدد الإجمالي للتمارين المسلَّمة في الأجزاء 0-5 (بما في ذلك التمارين المعلّمة بنجمة).</p>
<p>تُحسب الوحدات والتقديرات كما يلي:</p>
<table>
<thead>
<tr>
<th>التمارين</th>
<th style="text-align:center">الوحدات الدراسية</th>
<th style="text-align:center">التقدير</th>
</tr>
</thead>
<tbody>
<tr>
<td>116</td>
<td style="text-align:center">5</td>
<td style="text-align:center">5</td>
</tr>
<tr>
<td>105</td>
<td style="text-align:center">5</td>
<td style="text-align:center">4</td>
</tr>
<tr>
<td>94</td>
<td style="text-align:center">5</td>
<td style="text-align:center">3</td>
</tr>
<tr>
<td>83</td>
<td style="text-align:center">5</td>
<td style="text-align:center">2</td>
</tr>
<tr>
<td>72</td>
<td style="text-align:center">5</td>
<td style="text-align:center">1</td>
</tr>
</tbody>
</table>
<p>بمجرد إنجازك عدداً كافياً من التمارين للحصول على تقدير النجاح، يمكنك تنزيل شهادة الدورة من <a href="https://studies.cs.helsinki.fi/stats/courses/fullstackopen">نظام التسليم</a>.</p>
<p>إذا رغبت في الحصول على وحدات جامعية، فعليك أداء اختبار الدورة. ولا يُحتسب الاختبار ضمن تقديرك النهائي، لكن يجب اجتيازه. مزيد من المعلومات عن الاختبار <a href="/part0/general_info#the-course-exam">هنا</a>.</p>
<p>لا يمكنك أداء الاختبار إلا بعد تسليم تمارين كافية لخمس وحدات. وليس من الحكمة عملياً أداء الاختبار فور تسليم العدد الحاسم من التمارين. والاختبار نفسه لجميع الوحدات من 5 إلى 15 ولا يُحتسب ضمن تقديرك.</p>
<p><em>لا تحتاج إلى أداء اختبار الدورة أو التسجيل في دورة الجامعة المفتوحة للحصول على شهادة الدورة.</em></p>
<h4 id="الجزء-6-full-stack-web-development-إدارة-الحالة-وحدة-دراسية-واحدة-csm141082">الجزء 6 - Full Stack Web Development: إدارة الحالة (وحدة دراسية واحدة، CSM141082)</h4>
<p>نُقلت مادة الجزء 6 إلى <a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-state-management">https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-state-management</a>.</p>
<h4 id="الجزء-7-full-stack-web-development-الامتداد-وحدة-دراسية-واحدة-csm141083">الجزء 7 - Full Stack Web Development: الامتداد (وحدة دراسية واحدة، CSM141083)</h4>
<p>نُقلت مادة الجزء 7 إلى <a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-extension">https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-extension</a>.</p>
<h4 id="الجزء-8-full-stack-web-development-graphql-وحدة-دراسية-واحدة-csm14113">الجزء 8 - Full Stack Web Development: GraphQL (وحدة دراسية واحدة، CSM14113)</h4>
<p>نُقلت مادة الجزء 8 إلى <a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-graphql">https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-graphql</a>.</p>
<h4 id="الجزء-9-full-stack-web-development-typescript-وحدة-دراسية-واحدة-csm14110">الجزء 9 - Full Stack Web Development: TypeScript (وحدة دراسية واحدة، CSM14110)</h4>
<p>نُقلت مادة الجزء 9 إلى <a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-typescript">https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-typescript</a>.</p>
<h4 id="الجزء-10-full-stack-web-development-react-native-وحدتان-دراسيتان-csm14111">الجزء 10 - Full Stack Web Development: React Native (وحدتان دراسيتان، CSM14111)</h4>
<p>نُقلت مادة الجزء 10 إلى <a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-react-native">https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-react-native</a></p>
<h4 id="الجزء-11-full-stack-web-development-التكامل-المستمر-التسليم-المستمر-وحدة-دراسية-واحدة-csm14112">الجزء 11 - Full Stack Web Development: التكامل المستمر / التسليم المستمر (وحدة دراسية واحدة، CSM14112)</h4>
<p>نُقلت مادة الجزء 11 إلى <a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-continuous-integration">https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-continuous-integration</a>. وكل التفاصيل العملية مشروحة هناك.</p>
<h4 id="الجزء-12-full-stack-web-development-الحاويات-وحدة-دراسية-واحدة-csm141084">الجزء 12 - Full Stack Web Development: الحاويات (وحدة دراسية واحدة، CSM141084)</h4>
<p>نُقلت مادة الجزء 12 إلى <a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-containers">https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-containers</a>. وكل التفاصيل العملية مشروحة هناك.</p>
<h4 id="الجزء-13-full-stack-web-development-قواعد-البيانات-العلائقية-وحدة-دراسية-واحدة-csm14114">الجزء 13 - Full Stack Web Development: قواعد البيانات العلائقية (وحدة دراسية واحدة، CSM14114)</h4>
<p>نُقلت مادة الجزء 13 إلى <a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-relational-databases">https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-relational-databases</a>. وكل التفاصيل العملية مشروحة هناك.</p>
<h4 id="الجزء-14-full-stack-web-development-nextjs">الجزء 14 - Full Stack Web Development: Next.js</h4>
<p>المادة على العنوان <a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-nextjs">https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-nextjs</a></p>
<h3 id="دراسة-الدورة-باختصار">دراسة الدورة باختصار</h3>
<h4 id="كيف-تدرس-الدورة-تعليمات-مختصرة-الدورة-الأساسية-5-وحدات-csm141081">كيف تدرس الدورة – تعليمات مختصرة: الدورة الأساسية 5 وحدات CSM141081</h4>
<ul>
<li>أنجز التمارين. تُسلَّم التمارين عبر GitHub وتُعلَّم كمنجزة في <a href="https://studies.cs.helsinki.fi/stats/courses/fullstackopen">نظام التسليم</a>.
<ul>
<li><a href="/part0/general_info#course-certificate">شهادة الدورة</a> ستكون متاحة في نظام التسليم.</li>
</ul>
</li>
<li>إذا أردت الحصول على وحدات جامعة هلسنكي
<ul>
<li>سجّل في الدورة. ستحصل على رابط التسجيل عبر نظام التسليم بمجرد إنجازك عدداً كافياً من التمارين. اقرأ المزيد <a href="/part0/general_info#submitting-exercises">هنا</a></li>
<li>احفظ رقم طالبك. بعد التسجيل في الدورة، احفظ رقم هويتك الطلابية في جامعة هلسنكي في نظام التسليم.</li>
<li>أدِّ الاختبار عبر الإنترنت في نظام التسليم. اقرأ المزيد <a href="/part0/general_info#the-course-exam">هنا</a></li>
<li>علّم الدورة كمكتملة في نظام التسليم. اقرأ المزيد <a href="/part0/general_info#how-to-get-your-credits">هنا</a></li>
</ul>
</li>
</ul>
<h4 id="كيف-تدرس-الدورة-تعليمات-مختصرة-الأجزاء-6-14">كيف تدرس الدورة – تعليمات مختصرة: الأجزاء 6-14</h4>
<p>كل التفاصيل العملية مشروحة في صفحات الدورات الجديدة</p>
<ul>
<li><a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-state-management">الجزء 6</a></li>
<li><a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-extension">الجزء 7</a></li>
<li><a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-graphql">الجزء 8</a></li>
<li><a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-typescript">الجزء 9</a></li>
<li><a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-react-native">الجزء 10</a></li>
<li><a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-continuous-integration">الجزء 11</a></li>
<li><a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-containers">الجزء 12</a></li>
<li><a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-relational-databases">الجزء 13</a></li>
<li><a href="https://courses.mooc.fi/org/uh-cs/courses/full-stack-open-nextjs">الجزء 14</a></li>
</ul>
<h3 id="تسليم-التمارين">تسليم التمارين</h3>
<p>تُسلَّم التمارين عبر GitHub وتُعلَّم كمنجزة في تبويب «تسليماتي» (my submissions) في <a href="https://studies.cs.helsinki.fi/stats/courses/fullstackopen">تطبيق التسليم</a>.</p>
<p>إذا كنت تسلّم تمارين من أجزاء مختلفة إلى المستودع نفسه، فاستخدم نظاماً مناسباً لتسمية مجلداتك. ويمكنك بالطبع إنشاء مستودع جديد لكل جزء. وإذا كنت تستخدم مستودعاً خاصاً، فأضف <em>mluukkai</em> كمتعاون.</p>
<p>تُسلَّم التمارين <strong>جزءاً واحداً في كل مرة</strong>. وستحدد عدد التمارين التي أنجزتها من تلك الوحدة. وبمجرد تسليمك تمارين جزء ما، لن تتمكن من تسليم أي تمارين إضافية لذلك الجزء.</p>
<p>يُستخدم نظام لكشف الانتحال لفحص التمارين المسلَّمة إلى GitHub. وإذا وُجدت شيفرة من إجابات نموذجية أو سلّم عدة طلاب الشيفرة نفسها، فتُعالَج الحالة وفق <a href="https://guide.student.helsinki.fi/en/article/what-cheating-and-plagiarism">سياسة الانتحال</a> في جامعة هلسنكي.</p>
<p>تبني كثير من التمارين تطبيقاً أكبر شيئاً فشيئاً. وفي هذه الحالات يكفي تسليم التطبيق المكتمل فقط. يمكنك إجراء commit بعد كل تمرين، لكن ذلك ليس إلزامياً.</p>
<h3 id="اختبار-الدورة">اختبار الدورة</h3>
<p>للحصول على وحدات الجامعة الرسمية، عليك اجتياز اختبار الدورة الذي يغطي الأجزاء 1-5 من الدورة</p>
<ul>
<li>إذا رسبت في الاختبار، يمكنك إعادته بعد أسبوع واحد</li>
<li>يمكنك مواصلة التسليم بعد الاختبار</li>
</ul>
<p>يُؤدّى الاختبار في نظام تسليم التمارين. اتبع التعليمات أدناه لإكمال الاختبار.</p>
<ul>
<li>سجّل في الدورة عبر الجامعة المفتوحة.</li>
<li>ستحصل على رابط التسجيل عبر <a href="https://studies.cs.helsinki.fi/stats/courses/fullstackopen/submissions">نظام التسليم</a> بمجرد إنجازك عدداً كافياً من التمارين.</li>
</ul>
<p><img src="/images/content/0/enroll1.webp" alt="التسجيل في وحدات الجامعة"></p>
<p>بعد التسجيل في الدورة، احفظ رقم طالبك في جامعة هلسنكي في <a href="https://studies.cs.helsinki.fi/stats/myinfo">نظام التسليم</a>:</p>
<p><img src="/images/content/0/28b.webp" alt="حفظ رقم الطالب"></p>
<p>راجع <a href="/part0/general_info#where-do-i-get-my-university-of-helsinki-student-number">هذا</a> للحصول على معلومات حول كيفية العثور على رقم طالبك.</p>
<p>بعد هذه الخطوات، يمكنك أداء اختبار الدورة في نظام التسليم:</p>
<p><img src="/images/content/0/enroll3.webp" alt="بدء اختبار الدورة"></p>
<p>سيكون لديك 120 دقيقة لإكمال الاختبار. وإذا سار كل شيء على ما يرام، فسترى التأكيد التالي:</p>
<p><img src="/images/content/0/enroll4.webp" alt="تأكيد الاختبار النهائي"></p>
<p>إذا رسبت، فعليك الانتظار أسبوعاً واحداً لمحاولة الاختبار مجدداً.</p>
<p>إذا اجتزت الاختبار ولم تكن تنوي إنجاز مزيد من التمارين، يمكنك العودة إلى تبويب «تسليماتي» وطلب الوحدات:</p>
<p><img src="/images/content/0/enroll5a.webp" alt="طلب وحدات إكمال الدورة"></p>
<p>تذكّر أن تضغط الزر الأزرق الكبير لطلب تسجيل الوحدات.</p>
<p>لاحظ أنه يجب الضغط على الزر مرتين:</p>
<p><img src="/images/content/0/button2.webp" alt="الضغط على زر التأكيد"></p>
<p>عند الضغط مرتين، سترى النص التالي</p>
<blockquote>
<p><em>تسجيل وحدات الجامعة قيد التنفيذ...</em></p>
</blockquote>
<h3 id="كيف-تحصل-على-وحداتك">كيف تحصل على وحداتك</h3>
<p>إذا أردت الحصول على وحدات جامعة هلسنكي، فاحفظ رقم طالبك في <b>جامعة هلسنكي</b> في <a href="https://studies.cs.helsinki.fi/stats/courses/fullstackopen">نظام تسليم التمارين</a></p>
<p><img src="/images/content/0/28b.webp" alt="حفظ رقم الطالب"></p>
<p>إذا لم تكن طالباً في جامعة هلسنكي، يمكنك الحصول على رقم طالب عبر التسجيل في الدورة من خلال <a href="/part0/general_info#the-course-exam">الجامعة المفتوحة</a>، وراجع <a href="/part0/general_info#where-do-i-get-my-university-of-helsinki-student-number">هذا</a> لمزيد من المعلومات.</p>
<p>ستحصل على وحداتك بعد تسليم تمارين كافية لتقدير النجاح، واجتياز الاختبار، ثم إبلاغنا عبر نظام تسليم التمارين بأنك أكملت الدورة:</p>
<p><img src="/images/content/0/enroll5a.webp" alt="طلب وحدات إكمال الدورة"></p>
<p>تذكّر أن تضغط الزر الأزرق الكبير لطلب تسجيل الوحدات.</p>
<p>لاحظ أنه يجب الضغط على الزر مرتين:</p>
<p><img src="/images/content/0/button2.webp" alt="الضغط على زر التأكيد"></p>
<p>عند الضغط مرتين، سترى النص التالي</p>
<blockquote>
<p><em>تسجيل وحدات الجامعة قيد التنفيذ...</em></p>
</blockquote>
<p><strong>يرجى ملاحظة</strong> أن الحصول على وحدات الجامعة يتطلب تسجيلاً لكل جزء مكتمل. راجع <a href="/part0/general_info#parts-and-completion">مزيداً من المعلومات حول التسجيل</a>.</p>
<p>يمكنك الاطلاع على تقديرك في Sisu التابع لجامعة هلسنكي و<a href="https://opintopolku.fi/oma-opintopolku/">Opintopolku</a> بعد نحو أربعة أسابيع من إبلاغنا.</p>
<p>عند اكتمال التسجيل، يظهر النص التالي في نظام التسليم</p>
<blockquote>
<p><em>سُجّلت وحدات الجامعة، راجع صفحة الدورة لمعرفة كيفية الحصول على كشف درجات إن احتجت إليه</em></p>
</blockquote>
<h3 id="من-أين-أحصل-على-رقم-طالبي-في-جامعة-هلسنكي">من أين أحصل على رقم طالبي في جامعة هلسنكي</h3>
<p>عند تسجيلك في دورة لأول مرة عبر الجامعة المفتوحة، سيُنشأ لك رقم طالب في جامعة هلسنكي تلقائياً. *<strong>تأكد من أنك سجّلت في الدورة قبل أن تحاول معرفة رقم طالبك.</strong> *</p>
<p>لاحظ أيضاً أنك <strong>لا تحتاج إلى التسجيل</strong> في الجامعة المفتوحة للحصول على شهادة الدورة!</p>
<p>يمكنك معرفة رقم طالبك عبر أحد الخيارات التالية:</p>
<h4 id="أ-sisu">أ) Sisu</h4>
<p>إذا كان لديك حساب مستخدم في جامعة هلسنكي، فيمكنك العثور على رقم طالبك من ملفك الشخصي في نظام معلومات الدراسة Sisu التابع لجامعة هلسنكي:</p>
<ul>
<li>سجّل الدخول إلى Sisu باسم المستخدم وكلمة المرور الخاصين بجامعة هلسنكي.</li>
<li>اختر: ملفي الشخصي</li>
<li>اختر: المعلومات الشخصية</li>
</ul>
<h4 id="ب-رسالة-تأكيد-التسجيل">ب) رسالة تأكيد التسجيل</h4>
<p>بعد التسجيل في الدورة، ستتلقى رسالة بريد إلكتروني للتأكيد على عنوان البريد الإلكتروني الذي أدخلته في نموذج التسجيل. وتحتوي هذه الرسالة إما على رقم طالبك مباشرة أو على رابط ينقلك إلى صفحة تعرض رقم طالبك في جامعة هلسنكي.</p>
<h4 id="ج-التواصل-مع-خدمات-الطلاب">ج) التواصل مع خدمات الطلاب</h4>
<p>إذا واجهت صعوبة في العثور على رقم طالبك بالوسائل المذكورة أعلاه، فيمكنك إرسال بريد إلكتروني إلى خدمات الطلاب في جامعة هلسنكي. <em><strong>تأكد من أنك سجّلت في الدورة عبر الجامعة المفتوحة قبل إرسال البريد الإلكتروني!</strong></em></p>
<p>ضمّن في بريدك الإلكتروني المعلومات التالية</p>
<ul>
<li>اسم الدورة التي سجّلت فيها،</li>
<li>اسمك</li>
<li>تاريخ ميلادك.</li>
</ul>
<p>البريد الإلكتروني لخدمات الطلاب: avoin-student@helsinki.fi</p>
<p><strong>تذكير أخير:</strong> <em>تأكد من أنك سجّلت في الدورة عبر الجامعة المفتوحة قبل إرسال البريد الإلكتروني</em></p>
<h3 id="شهادة-الدورة">شهادة الدورة</h3>
<p>حتى إذا لم تسجّل في الجامعة المفتوحة من أجل الاختبار والوحدات، فلا يزال بإمكانك تنزيل شهادة الدورة من تبويب «تسليماتي» في <a href="https://studies.cs.helsinki.fi/stats/courses/fullstackopen">نظام التسليم</a> بمجرد إنجازك عدداً كافياً من التمارين لتقدير النجاح.</p>
<p>توجد شهادة واحدة للأجزاء الأساسية (0-7) من الدورة، وبعدها شهادة منفصلة لكل جزء من أجزاء الدورة.</p>
<h3 id="طلب-كشف-درجات">طلب كشف درجات</h3>
<p>يمكنك طلب كشف درجات موثّق <em>بعد تسجيل وحدات جامعتك</em>. ويمكنك طلب كشف الدرجات باستخدام <a href="https://elomake.helsinki.fi/lomakkeet/132797/lomake.html?rinnakkaislomake=Rinnakkaislomake1_en%5Bk%5D">النموذج الإلكتروني</a> لخدمات الطلاب.</p>
<p>سيُرسَل إليك كشف درجات إلكتروني عبر البريد الإلكتروني. اعرض هذه الوثيقة على مؤسستك لإدراج الوحدات في شهادتك. وتتخذ مؤسستك الأم قرار إدراج الوحدات.</p>
<h3 id="لا-إصدارات-سنوية-بعد-الآن">لا إصدارات سنوية بعد الآن</h3>
<p>لا توجد «إصدارات سنوية» للدورة، فهي متاحة طوال الوقت. ويُحدَّث كل جزء مرة أو مرتين سنوياً. والتحديثات غالباً بسيطة: تُحدَّث إصدارات المكتبات ويُحسَّن وضوح النص. ومع ذلك، قد توجد أيضاً بعض التغييرات الأكبر.</p>
<p>ورغم التغييرات <em>تبقى جميع التمارين المسلَّمة صالحة</em>، ويمكن متابعة الدورة دون القلق بشأن التحديثات. كذلك ستبقى سياسة الحصول على الشهادات ووحدات الجامعة وغيرها كما هي مهما حدث.</p>
<p>أبرز التغييرات الأخيرة</p>
<ul>
<li>الجزء 14 (25 أبريل 2026): إضافة جزء جديد</li>
<li>الجزء 10 (21 أبريل 2026): تحديث إصدار Expo والمكتبات</li>
<li>الجزء 7 (5 أبريل 2026): استُبدل Webpack بـ esbuild، وتغطية حدود الأخطاء وإبقاء الواجهة الأمامية والخلفية في مستودع واحد</li>
<li>الجزء 6 (5 أبريل 2026): استُبدل Redux بـ Zustand</li>
<li>الجزء 5 (31 مارس 2026): نُقل React Router ومكتبات التنسيق من الجزء 7 إلى هذا الجزء</li>
<li>الأجزاء 9 و11-13 (مارس 2026): تحديث المحتوى ونقل المادة إلى منصة جديدة</li>
<li>الجزء 8: (3 يناير 2026) تحديث Apollo Server إلى الإصدار 5. وتحديث Apollo Client إلى الإصدار 4. ونقل إعادة هيكلة شيفرة الواجهة الخلفية إلى الجزء 8c. والكثير من التحسينات الصغيرة الأخرى.</li>
<li>الجزء 4 (13 أغسطس 2025): تحديث Express إلى الإصدار 5 وإزالة مكتبة express-async-errors من الجزء 4b</li>
</ul>
<h3 id="التوسع-في-دورة-أكملتها-سابقا">التوسّع في دورة أكملتها سابقاً</h3>
<p>إذا كنت قد درست الدورة سابقاً إما كـ MOOC أو كمقرر جامعي، فيمكنك الآن التوسّع فيها.</p>
<h4 id="التوسع-في-full-stack-open">التوسّع في Full stack open</h4>
<p>يمكنك ببساطة المتابعة من حيث توقفت! وإذا أردت إعادة تسليم جزء كامل، فتواصل مع فريق الدورة عبر <a href="mailto:matti.luukkainen@helsinki.fi">البريد الإلكتروني</a> أو حساب <em>mluukkai</em> على Discord، مع ذكر اسم المستخدم في GitHub والأجزاء التي تريد حذفها من تسليماتك.</p>
<h4 id="التوسع-في-نسخة-جامعة-هلسنكي-من-هذه-الدورة">التوسّع في نسخة جامعة هلسنكي من هذه الدورة</h4>
<p>هذا ممكن أيضاً، ما عليك سوى التواصل مع فريق الدورة عبر <a href="mailto:matti.luukkainen@helsinki.fi">البريد الإلكتروني</a> أو حساب <em>mluukkai</em> على Discord.</p>
<h3 id="مشروع-full-stack">مشروع Full stack</h3>
<p>سيتاح مشروع Full stack بقيمة 5 أو 7 أو 10 وحدات دراسية عبر الجامعة المفتوحة.</p>
<p>في المشروع، يُنفَّذ تطبيق باستخدام React و/أو Node، مع إمكانية تنفيذ تطبيق جوال باستخدام React Native أيضاً.</p>
<p>يُحدَّد عدد الوحدات بناءً على ساعات العمل المنجزة. والوحدة الدراسية الواحدة تعادل نحو 17.5 ساعة عمل. ويُقيَّم العمل بنجاح/رسوب.</p>
<p>ويمكن إكمال المشروع بشكل ثنائي أو جماعي.</p>
<p>راجع <a href="https://github.com/fullstack-hy2020/misc/blob/master/project.md">مزيداً من المعلومات عن المشروع</a>.</p>
<h3 id="وعد-المقابلة">وعد المقابلة</h3>
<p>منح شركاؤنا <a href="https://www.terveystalo.com/en/">Terveystalo</a> و<a href="https://www.smartly.io/">Smartly.io</a> <em>وعداً بمقابلة عمل</em> لكل من يكمل الدورة والعمل المشروع بأقصى عدد من الوحدات (15 + 10).</p>
<p>وهذا يعني أن الطالب يستطيع، إن اختار ذلك، التسجيل لمقابلة عمل مع الشريك الذي منح الوعد. وسيرسل مدرّس الدورة، Matti Luukkainen، التعليمات إلى الطالب بعد إكمال الدورات بأقصى عدد من الوحدات.</p>
<p>ويجب أن تكون مقيماً في فنلندا للمشاركة في هذه المقابلات.</p>
<h3 id="قبل-أن-تبدأ">قبل أن تبدأ</h3>
<p>يُوصى باستخدام <a href="https://www.google.com/chrome/">متصفح Chrome</a> لهذه الدورة لأنه يوفر أفضل أدوات لتطوير الويب. والبديل الآخر هو <a href="https://www.mozilla.org/en-US/firefox/developer/">إصدار المطوّر من Firefox</a>، الذي يوفر المجموعة نفسها من الميزات.</p>
<p>تُسلَّم تمارين الدورة إلى GitHub، لذا يجب تثبيت Git ومعرفة كيفية استخدامه. وللاطلاع على التعليمات، راجع <a href="https://product.hubspot.com/blog/git-and-github-tutorial-for-beginners">درس Git وGitHub للمبتدئين</a>.</p>
<p>ثبّت محرر نصوص مناسباً يدعم تطوير الويب. ويُوصى بشدة بـ <a href="https://code.visualstudio.com/">Visual Studio Code</a>.</p>
<p>لا تكتب الشيفرة باستخدام nano أو Notepad أو Gedit. وNetBeans ليس جيداً كثيراً لتطوير الويب أيضاً، وهو ثقيل نسبياً مقارنة بـ <a href="https://code.visualstudio.com/">Visual Studio Code</a>.</p>
<p>ثبّت أيضاً <a href="https://nodejs.org/en/">Node.js</a>. استخدم الإصدار 24 على الأقل. وتجد تعليمات التثبيت على <a href="https://nodejs.org/en/download/package-manager/">موقع Node.js</a>.</p>
<p>ستُثبَّت مدير حزم Node، وهو <a href="https://www.npmjs.com/get-npm">npm</a>، تلقائياً مع Node.js. وسنستخدم npm باستمرار طوال الدورة. ويأتي Node أيضاً مع <a href="https://www.npmjs.com/package/npx">npx</a>، الذي سنحتاجه بضع مرات.</p>
<h3 id="الأخطاء-المطبعية-في-المادة">الأخطاء المطبعية في المادة</h3>
<p>إذا وجدت خطأً مطبعياً في المادة، أو كان شيء ما معبَّراً عنه بشكل غير واضح أو بقواعد نحوية سيئة، فأرسل <em>pull request</em> إلى مادة الدورة في <a href="https://github.com/fullstack-hy2020/fullstack-hy2020.github.io">المستودع</a>. على سبيل المثال، يمكن العثور على الشيفرة المصدرية بصيغة markdown لهذه الصفحة في المستودع على <a href="https://github.com/fullstack-hy2020/fullstack-hy2020.github.io/edit/source/src/content/0/en/part0a.md">https://github.com/fullstack-hy2020/fullstack-hy2020.github.io/edit/source/src/content/0/en/part0a.md</a></p>
<p>في أسفل كل جزء من المادة يوجد رابط <em>اقترح تغييرات على المادة</em>. ويمكنك تعديل الشيفرة المصدرية للصفحة بالنقر على الرابط.</p>
<p>توجد أيضاً روابط كثيرة في المادة لأنواع عديدة من المواد الخلفية. وإذا لاحظت أن رابطاً ما معطوب (وهذا يحدث كثيراً جداً...)، فاقترح تغييراً أو نادنا على Discord إذا لم تجد بديلاً للرابط المعطوب.</p>
</div>
`,a={part:0,letter:"a",file:e,title:t,slug:n,mainImage:s,headings:p,html:o};export{a as default,e as file,p as headings,o as html,i as letter,s as mainImage,l as part,n as slug,t as title};
